## 2)Loading Dataset and Basic Inspection

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student.csv')
df

   Student_ID        Full_Name                   Major   GPA  Graduation_Year
0        1001    Liam Anderson        Computer Science  3.85             2026
1        1002  Sophia Martinez  Mechanical Engineering  3.62             2025
2        1003    Marcus Wright            Data Science  3.91             2027
3        1004    Isabella Chen                 Biology  3.74             2026
4        1005    Julian Brooks               Economics  3.45             2025
5        1006  Elena Rodriguez              Psychology  3.88             2026
6        1007     Oliver Quinn             Mathematics  3.95             2027

In [3]:
df.head()

   Student_ID        Full_Name                   Major   GPA  Graduation_Year
0        1001    Liam Anderson        Computer Science  3.85             2026
1        1002  Sophia Martinez  Mechanical Engineering  3.62             2025
2        1003    Marcus Wright            Data Science  3.91             2027
3        1004    Isabella Chen                 Biology  3.74             2026
4        1005    Julian Brooks               Economics  3.45             2025

In [4]:
df.tail()

   Student_ID        Full_Name         Major   GPA  Graduation_Year
2        1003    Marcus Wright  Data Science  3.91             2027
3        1004    Isabella Chen       Biology  3.74             2026
4        1005    Julian Brooks     Economics  3.45             2025
5        1006  Elena Rodriguez    Psychology  3.88             2026
6        1007     Oliver Quinn   Mathematics  3.95             2027

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Student_ID       7 non-null      int64
 1   Full_Name        7 non-null      object
 2   Major            7 non-null      object
 3   GPA              7 non-null      float64
 4   Graduation_Year  7 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 412.0+ bytes

In [6]:
df.describe()

        Student_ID       GPA  Graduation_Year
count     7.000000  7.000000         7.000000
mean   1004.000000  3.771429      2026.000000
std       2.160247  0.180871         0.816497
min    1001.000000  3.450000      2025.000000
25%    1002.500000  3.680000      2025.500000
50%    1004.000000  3.850000      2026.000000
75%    1005.500000  3.895000      2026.500000
max    1007.000000  3.950000      2027.000000